; Korean

[ABOUT]

1000 = 프로그램에 대하여
1001 = 프로그램에 대하여

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[COMM_SET]

2000 = 통신 설정
2001 = 통신 설정

2010 = 통신 방식

2020 = 시리얼 통신
2021 = 통신포트 :
2022 = 통신속도 :
2023 = 패리티    :
2024 = 데이터    :
2025 = 스탑비트 :
2026 = 흐름제어 :

2030 = 페러럴 통신
2031 = 통신포트 :

2040 = TCP/IP 통신
2041 = IP 주소 :
2042 = 포트 :

2050 = 확인
2051 = 취소

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[MAIN]

3000 = KitchenBell Maker for SAM4S Thermal Printer

3010 = 파일(&F)
3011 = 가져오기...
3012 = 내보내기...
3013 = 프로그램 종료

3020 = 설정(&S)
3021 = 일반 설정
3022 = 언어 설정
3023 = 비프음 설정
3024 = 포트 열기
3025 = 포트 닫기
3026 = 통신 설정

3030 = 도움말(&H)
3031 = 도움말...
3032 = 프로그램에 대하여

3040 = 음계 및 인터벌 설정
3041 = 음계
3042 = ON 인터벌
3043 = OFF 인터벌
3044 = 초기화 (&C)

3050 = 샘플 음원(&M)
3051 = 재생(&P)
3052 = 기본값으로 설정(&D)
3053 = 프린터에 저장...(&T)
3054 = 인쇄(&R)

3060 = 전송 대기
3061 = 프린터로 전송하는 중
3062 = 전송 완료

3070 = 도
3071 = 레
3072 = 미
3073 = 파
3074 = 솔
3075 = 라
3076 = 시

3080 = 솔[5]
3081 = 라[5]
3082 = 시[5]
3083 = 도[6]
3084 = 레[6]
3085 = 미[6]
3086 = 파[6]
3087 = 솔[6]
3088 = 라[6]
3089 = 시[6]
3090 = 도[7]
3091 = 레[7]
3092 = 미[7]

3100 = 솔#[5]
3101 = 라#[5]
3102 = 도#[6]
3103 = 레#[6]
3104 = 파#[6]
3105 = 솔#[6]
3106 = 라#[6]
3107 = 도#[7]
3108 = 레#[7]

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[HELP]

4000 = 도움말 및 지원
4001 = 도움말 및 지원

4010 = 각 기능에 따른 도움말은 통합적으로 구성된 PDF파일로 제공됩니다.
4011 = PDF파일을 열기 위해 "Adobe Acrobat Reader DC" 설치를 권장합니다.
4012 = https://get.adobe.com/kr/reader/ (Freeware)
4013 = - 또는 -
4014 = Google Chrome 웹브라우저로 PDF파일을 열 수 있습니다.
4015 = https://chrome.google.com/ (Freeware)

4020 = 도움말 문서

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[LANG_SET]

5000 = 언어 설정
5001 = 언어

5010 = 언어
5011 = English
5012 = 한국어

5020 = 시스템 기본 언어 사용

5030 = 확인
5031 = 취소


[NOW_WORKING]

6000 = 재생하는 중...

6010 = 지금 음악 재생 또는 데이터를 전송하고 있습니다.\n잠시만 기다려 주십시오.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[SAMPLE_MELODY]

7000 = 샘플 음원
7001 = 음원 선택

7010 = 학교종
7011 = 떳다떳다 비행기
7012 = 산토끼
7013 = 퐁당퐁당
7014 = 똑같아요

7020 = 확인
7021 = 취소

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[MESSAGE]
		; comm_Set.cs
8000 = [CODE 8000] 시리얼 통신 설정이 잘못되었습니다. 다시 설정해주세요.
8001 = [CODE 8001] 알 수 없는 오류가 발생했습니다. 통신을 시작할 수 없습니다.

		; Form1.cs
8010 = 오류!
8011 = 알림!
8012 = 문제 발생!
8013 = 실패!

8020 = [CODE 8020] 개수를 초과했습니다. 다시 작업하시려면 초기화 버튼을 눌러주세요.
8021 = 음원 파일을 선택해 주십시오...
8022 = [CODE 8022] 음원데이터가 없습니다. 내보내기 기능을 실행할 수 없습니다.
8023 = [CODE 8023] 포트가 열려있지 않습니다. 포트를 여신 후 다시 시도해주세요.
8024 = [CODE 8024] 데이터가 없습니다.
8025 = 프린터에서 재생이 시작됩니다. 프린터에서 소리를 확인하세요.
8026 = 프린터에서 출력되는 완료 비프음을 기다리세요...
8027 = [CODE 8027] 통신설정을 하지 않으셨습니다. 통신설정을 하신 후 다시 시도해주십시오.
8028 = [CODE 8028] 시리얼 포트를 여는 도중 오류 발생.
8029 = [CODE 8029] 연결에 실패했습니다. 케이블 연결, 전원 및 통신포트 설정 상태를 확인하세요.
8030 = 음원 파일을 저장할 위치를 선택하십시오...
8031 = 프린터에 음원파일을 저장합니다. 계속 진행하시겠습니까?
8032 = 프린터에 저장되어 있는 음원파일을 삭제합니다. 계속 진행하시겠습니까?
8033 = [CODE 8033] 프로그램이 이미 실행 중입니다!! 같은 프로그램을 두개 이상 실행할 수 없습니다.
8034 = [CODE 8034] 포트가 이미 열려있습니다. 먼저 포트를 닫아주세요.
8035 = '음계' 는 도, 레, 미와 같은 계이름 입니다.
8036 = 'ON 인터벌'은 현재 음이 재생되는 시간입니다. 단위는 ms입니다. (125ms=0.125s, 2000ms=2s)
8037 = 'OFF 인터벌'은 현재 음이 끝나고 다음 음이 재생되기 전 기다리는 시간입니다. "쉼표"와 같으며 단위는 ms입니다. (16ms=0.016s, 1000ms=1s)
8038 = [CODE 8038] 언어팩이 없습니다!! 실행 파일을 올바른 위치로 이동하십시오.

		; Help.cs
8040 = [CODE 8040] 파일을 여는 도중 오류가 발생했습니다. 파일이 없거나 해당경로에 문제가 있습니다.

		; lang_Set.cs
8050 = 한국어로 설정되었습니다. 프로그램 재시작 후 적용됩니다.
8051 = 한국어와 영어 시스템이 아님.

		; sample_Melody.cs
8060 = [CODE 8060] 멜로디를 선택하지 않으셨습니다.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[BEEP]
		; beep_Settings
9000 = 비프음 설정
9001 = 비프음 설정

9010 = 비프음 켜기/끄기
9011 = 켜기
9012 = 끄기

9020 = 확인
9021 = 취소

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		; Help
[MANUAL]

10000 = \Manual\KitchenBell_Maker_User_Manual_KOR.pdf